import 'package:arcore_flutter_plugin_example/common/controller/localizations/locale_key.dart';

Map<String, String> arabic = {
  LocaleKey.start: "أبدا",

  //All thing about Cat
  LocaleKey.cat: "قط",
  LocaleKey.catDescription:
      'القطط هي واحدة من الحيوانات الأليفة الأكثر شعبية في العالم ، إن لم تكن أكثرها شهرة. تحافظ القطط على الطاقة عن طريق النوم بمعدل 13 إلى 14 ساعة في اليوم. القطط لها أجسام وأسنان مرنة تتكيف مع صيد الحيوانات الصغيرة مثل الفئران والجرذان. تتمتع القطط بحاسة سمع ممتازة وحاسة شم قوية.'
          '\nبعض المعلومات الأخرى عن حيوان القط:'
          '\nصوته يسمي مواء.'
          '\nأنثي القط تسمى قطة أو ملكة.'
          '\nالقطط الصغيرة تسمى هريرة.'
          '\nتتغذى على اللحوم والفئران ، ويمكنها أن تأكل بعض طعام الإنسان. هم حيوانات أليفة ويتم تربيتهم في المنازل.',
  LocaleKey.femaleCat: 'قطة او ملكة',
  LocaleKey.babyCat: 'هريرة',
  LocaleKey.feedOnCat: 'اللحوم و الفئران و بعض طعام الانسان',
  LocaleKey.nameOfSoundCat: 'مواء',

  //All thing about Dog
  LocaleKey.dog: "كلب",
  LocaleKey.dogDescription:
      'تتمتع الكلاب بحاسة شم رائعة حقًا ، ويمكن أن تشم رائحتها أفضل من البشر بما يصل إلى 100000 مرة. أنوف الكلاب مبللة لامتصاص المواد الكيميائية الرائحة. الكلاب ذكية جدا. الكلاب عدائيون سريعون جدًا ، يمكنهم الركض لمسافة تصل إلى 45 ميلاً في الساعة. يمكن للكلاب أن تشم في نفس وقت التنفس. بعض الكلاب سباحون رائعون.'
          '\nبعض المعلومات الأخرى عن حيوان الكلب:'
          '\nصوته يسمى نباح.'
          '\nأنثي الكلب يسمى الكلبة.'
          '\nطفل كلب يسمى جرو.'
          '\nتتغذى على اللحوم والأطعمة الجافة ويمكنها أن تأكل بعض طعام الإنسان.',
  LocaleKey.femaleDog: 'الكلبة',
  LocaleKey.babyDog: 'جرو',
  LocaleKey.feedOnDog: 'اللحوم والأطعمة الجافة وبعض طعام الإنسان',
  LocaleKey.nameOfSoundDog: 'نباح',

  //All thing about Bear
  LocaleKey.bear: "دب",
  LocaleKey.bearDescription:
      'جميع الدببة - باستثناء الدببة القطبية والباندا العملاقة - حيوانات آكلة للحوم. الدببة إقليمية ، مما يعني أنها ستقاتل الدببة الأخرى من أجل حماية أراضيها والاحتفاظ بها. سوف تجد الدببة الطعام والمأوى والأصحاب في هذه المنطقة. تتمتع جميع الدببة بحاسة شم ممتازة ، مما يسمح لها بشم الطعام والأصحاب وأشبالهم (الدببة الصغيرة). تعيش الدببة البنية في شمال غرب أمريكا الشمالية وفي جميع أنحاء أوروبا وآسيا. غالبًا ما تدخل الدببة البنية في معارك خطيرة على المناطق الغنية بسمك السلمون.'
          '\nبعض المعلومات الأخرى عن حيوان الدب:'
          '\nصوته يسمى قَهْقَاع.'
          '\nأنثى الدب تسمى جهيزة.'
          '\nطفل دب يسمى دَيْسَم.'
          '\nتتغذى على اللحوم والنباتات.',
  LocaleKey.femaleBear: 'جهيزة',
  LocaleKey.babyBear: 'دَيْسَم',
  LocaleKey.feedOnBear: 'اللحوم والنباتات',
  LocaleKey.nameOfSoundBear: 'قَهْقَاع',

  //All thing about Tiger
  LocaleKey.tiger: "نمر",
  LocaleKey.tigerDescription:
      'النمر هو قطة كبيرة قوية ذات معطف مميز من اللون البرتقالي الداكن مع خطوط سوداء. كانوا يعيشون في آسيا. يمكن للنمور أن تعيش حتى سن 20 عامًا في حدائق الحيوان ولكن فقط 15 عامًا في البرية. النمور سباحون رائعون. يمكن لنمر متوسط الحجم أن يأكل ما يصل إلى 60 رطلاً من اللحم في المرة الواحدة. معظم النمور لديها أكثر من 100 شريط. شرائطهم تشبه إلى حد كبير بصمات الأصابع ، لأنه لا يوجد نمرين متشابهين تمامًا.'
          '\nبعض المعلومات الأخرى عن حيوان النمر:'
          '\nصوته يسمى تذمر.'
          '\nأنثى النمر تسمى كثعم.'
          '\nطفل النمر يسمى الهِرْمَاسُ.'
          '\nتتغذى على الفرائس مثل الغزلان والجاموس.',
  LocaleKey.femaleTiger: 'كثعم',
  LocaleKey.babyTiger: 'الهِرْمَاسُ',
  LocaleKey.feedOnTiger: 'يتغذى على الفريسة مثل الغزلان والجاموس',
  LocaleKey.nameOfSoundTiger: 'تذمر',

  LocaleKey.shark: "قرش",
  LocaleKey.sharkDescription:
      "تستخدم أسماك القرش خياشيمها لتصفية الأكسجين من الماء. إنها نوع خاص من الأسماك يُعرف باسم الخياشيم ، والتي تُترجم إلى أسماك مصنوعة من الأنسجة الغضروفية - وهي المادة الخشنة الشفافة التي تتكون منها أذنيك وطرف أنفك. تشمل هذه الفئة أيضًا الأشعة ، وسمك المنشار ، والزلاجات. الهياكل العظمية الغضروفية أخف بكثير من العظام الحقيقية وأكبادها الكبيرة مليئة بالزيوت منخفضة الكثافة ، وكلاهما يساعدها على الانتعاش.",
  LocaleKey.snake: "ثعبان",
  LocaleKey.snakeDescription:
      "الثعابين صم ولا تسمع أصواتاً. تعيش الثعابين في حدائق الحيوان لفترة أطول مما تعيش في البرية. تمتلك معظم الثعابين حوالي 200 سن تسمح لها بمضغ طعامها. على الرغم من أن بعض الثعابين لها عيون ، إلا أنها لا تستطيع الرؤية بشكل صحيح حتى في النهار ، وعلى الرغم من أنها تعتمد على حاسة الشم ، إلا أن الثعابين ليس لديها أنوف. واحدة من أكثر الأشياء إثارة للاهتمام هي قدرتها على التنفس تحت الماء ، ويمكنهم فعل ذلك جزئيًا من خلال جلدهم.",
  LocaleKey.sound: "صوت",
  LocaleKey.quize: "اختبار",
  LocaleKey.AR: "الواقع المعزز",
  LocaleKey.setting: "الاعدادات",
  LocaleKey.connectUs: "تواصل معنا",
  LocaleKey.quitApp: "الخروج من التطبيق",
  LocaleKey.language: "اللغة",
  LocaleKey.arabic: "عربي",
  LocaleKey.english: "انجليزي",
  LocaleKey.aboutUs: "عنا",
  LocaleKey.q1: "ما اسم هذا الحيوان؟",
  LocaleKey.q2: 'ما اسم انثى هذا الحيوان؟',
  LocaleKey.q3: 'ما اسم طفل هذا الحيوان؟',
  LocaleKey.q4: 'على ماذا يتغذى هذا الحيوان؟',
  LocaleKey.q5: 'ما الصوت الذي يصدره هذا الحيوان؟',
  LocaleKey.check:'فحص',
  LocaleKey.theAnswerIsWrong:'الجواب خاطئ',
  LocaleKey.tryAgain:'حاول مرة أخري',
  LocaleKey.wellDone:'أحسنت صنعا.',
  LocaleKey.youHaveSuccessfullyCompletedAllTheQuestions:'لقد أكملت جميع الأسئلة بنجاح.',
};
